import math

#AknurAiganym Пайдаланушыдан коэффициенттерді сұрау
a = float(input("a коэффициентін енгізіңіз: "))
b = float(input("b коэффициентін енгізіңіз: "))
c = float(input("c коэффициентін енгізіңіз: "))

# Дискриминантты есептеу
D = b**2 - 4*a*c

# Дискриминанттың мәніне байланысты түбірлерді анықтау
if D > 0:
    # Екі түбір бар
    x1 = (-b + math.sqrt(D)) / (2 * a)
    x2 = (-b - math.sqrt(D)) / (2 * a)
    print(f"Теңдеудің екі түбірі бар: x1 = {x1}, x2 = {x2}")
elif D == 0:
    # Бір түбір бар
    x = -b / (2 * a)
    print(f"Теңдеудің бір түбірі бар: x = {x}")
else:
    # Нақты түбір жоқ
    print("Теңдеудің нақты түбірі жоқ.")
